In [1]:
# установка пакета мат. операций
!pip install numpy==1.18.5

Requirement already satisfied: numpy==1.18.5 in /usr/local/lib/python3.6/dist-packages (1.18.5)

In [2]:
!pip install pandas==1.0.0

Requirement already satisfied: pandas==1.0.0 in /usr/local/lib/python3.6/dist-packages (1.0.0)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas==1.0.0) (1.15.0)

In [3]:
import pandas as pd

In [4]:
# СОЗДАНИЕ ОБЪЕКТА ТАБЛИЦЫ

import numpy as np

arr = np.random.randint(0, 10, size=(5, 3))
print(arr)

[[4 6 0]
 [2 6 2]
 [9 1 3]
 [3 2 5]
 [4 8 9]]

In [ ]:
# Создание фрейма - просто вызвать конструктор
df = pd.DataFrame(data=arr)
# Фреймы удобнее отображать с помощью встроенных средств Jupyter
df

   0  1  2
0  8  1  3
1  2  4  0
2  3  0  9
3  0  7  3
4  6  2  3

In [ ]:
# ЗАДАНИЕ: Создайте фрейм с именами колонок 'col_1', 'col_2', 'col_3' и индексами по алфавиту ('A', 'B', 'C', ... или 'A', 'Б', 'В', ...).

arr = np.random.randint(0, 10, size=(5, 3))
new_arr = {"col_1": pd.Series(arr[:,0], index=['A','B','C','D','E']),"col_2":pd.Series(arr[:,1], index = ['A','B','C','D','E']),"col_3":pd.Series(arr[:,2], index = ['A','B','C','D','E'])}

arr_table = pd.DataFrame(new_arr)

arr_table

   col_1  col_2  col_3
A      3      2      1
B      6      2      6
C      8      7      6
D      5      3      2
E      0      3      0

In [ ]:
# СОЗДАНИЕ ФРЕЙМА ИЗ СЛОВАРЕЙ

# Создается словарь, в котором ключи будут названиями колонок,
#   а значения - данные по этим колонкам
data = {
    'test_1_mark': [4.6, 3.8, 5.0, 4.5],
    'test_2_mark': [5.0, 3.9, 4.7, 4.5]
}

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          4.7
3          4.5          4.5

In [ ]:
# Создается список записей, каждая запись представлена словарем
# В словаре ключи - названия колонок
# При создании фрейма pandas просмотри все возможные ключи словарей в списке
#   и создаст колонок по их названиям
data = [
    {
        'test_1_mark': 4.6,
        'test_2_mark': 5.0
    },
    {
        'test_1_mark': 3.8,
        'test_2_mark': 3.9
    },
    {
        'test_1_mark': 5.0
    },
]

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          NaN

In [ ]:
# ТИПЫ ДАННЫХ

df = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': np.array([2.] * 4, dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})
df

     A          B    C  D      E    F
0  1.0 2013-01-02  2.0  3   test  foo
1  1.0 2013-01-02  2.0  3  train  foo
2  1.0 2013-01-02  2.0  3   test  foo
3  1.0 2013-01-02  2.0  3  train  foo

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 356.0+ bytes

In [63]:
# ОБЗОР ДАННЫХ

df = pd.DataFrame(
    data=np.random.randint(-10, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)

# Функция получения первых записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.head(4)

   x1  x2  x3
0   7   7 -10
1   0  -3   5
2  -4   4  -3
3  -5  -2   1

In [ ]:
# Функция получения последних записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.tail(4)

    x1  x2  x3
11   2   1   6
12   6  -4   3
13   7   2   7
14  -1   0   4

In [ ]:
# Функция отображения основной информации о фрейме:
#   Количество записей
#   Типы колонок
#   Количество ненулевых значений
#   Тип индекса
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x1      15 non-null     int64
 1   x2      15 non-null     int64
 2   x3      15 non-null     int64
dtypes: int64(3)
memory usage: 488.0 bytes

In [ ]:
# Функция отображения статистики по численным колонкам
df.describe()

              x1         x2         x3
count  15.000000  15.000000  15.000000
mean    4.733333   4.866667   3.866667
std     3.348063   2.356349   2.386470
min     0.000000   2.000000   0.000000
25%     2.500000   3.000000   2.500000
50%     4.000000   3.000000   4.000000
75%     8.500000   6.500000   5.000000
max     9.000000   9.000000   8.000000

In [ ]:
# Атрибут получения индексов фрейма
df.index

RangeIndex(start=0, stop=15, step=1)

In [ ]:
# Или чтобы представить в виде списка
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [ ]:
# Атрибут получения имен колонок фрейма
df.columns

Index(['x1', 'x2', 'x3'], dtype='object')

In [ ]:
# Атрибут размерности фрейма
df.shape

(15, 3)

In [ ]:
# Преобразование к двумерному массиву numpy
df.to_numpy()

array([[9, 3, 3],
       [3, 3, 4],
       [0, 8, 8],
       [9, 6, 2],
       [3, 3, 8],
       [4, 8, 5],
       [1, 3, 4],
       [9, 3, 3],
       [8, 6, 4],
       [9, 9, 6],
       [5, 2, 2],
       [2, 3, 0],
       [4, 3, 0],
       [5, 7, 5],
       [0, 6, 4]])

In [ ]:
# Получение транспонированного представления
# Колонки -> ряды, ряды -> колонки
df.T

# (*) Транспонирование вряд ли часто понадобится при анализе, но учитывать стоит

    0   1   2   3   4   5   6   7   8   9   10  11  12  13  14
x1   9   3   0   9   3   4   1   9   8   9   5   2   4   5   0
x2   3   3   8   6   3   8   3   3   6   9   2   3   3   7   6
x3   3   4   8   2   8   5   4   3   4   6   2   0   0   5   4

In [64]:
# ОБРАЩЕНИЕ К ДАННЫМ

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)

df

   x1  x2  x3
0   2   9   9
1   0   2   8
2   2   8   1
3   9   5   0
4   8   8   7

In [65]:
print(df['x1'])
print(type(df['x1']))

0    2
1    0
2    2
3    9
4    8
Name: x1, dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [ ]:
df.iloc[2]

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [ ]:
df.loc['C']

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [ ]:
df.iloc[2, 1]

1.4285714285714286

In [ ]:
df.loc['C', 'feature2']

1.4285714285714286

In [ ]:
# ЗАДАНИЕ: Выведите часть фрейма со второго ряда по девятый (индексы с 'C' по 'I') и только feature1 и feature3:

data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [ ]:
df.loc['C':'I',['feature1','feature3']]

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

In [ ]:
df.iloc[2:9,[0,2]]

   x1  x3
2   3  -2
3  -9   5
4   6   7
5  -5  -1
6   6 -10
7  -4  -7
8  -8   4

In [ ]:
# УСЛОВНАЯ ИНДЕКСАЦИЯ

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   4   1   4
1   0   1   0
2   9   2   6

In [ ]:
df['x1'] > 5

0     False
1     False
2      True
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14    False
Name: x1, dtype: bool

In [ ]:
mask = df['x1'] > 5
df[mask]

# Или df[df['x1'] > 5]

    x1  x2  x3
2    9   2   6
4    9   8   4
10   7   9   6

In [ ]:
df[~(df['x1'] > 5)]

    x1  x2  x3
0    4   1   4
1    0   1   0
3    3   8   6
5    2   6   2
6    0   5   4
7    1   9   0
8    4   1   2
9    0   5   3
11   4   2   7
12   0   0   5
13   2   7   6
14   3   1   8

In [ ]:
# ЗАДАНИЕ: Выберите записи во фрейме, которые по признаку x1 имеют значение больше 3, 
# а по признаку x3 - меньше 8.

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   9   4   9
1   2   7   6
2   0   3   6

In [ ]:
# TODO - отфильтровать фрейм по значениям признаков
mask = df[df['x1'] > 3]
new_df = mask[~(mask['x3'] > 8)]
new_df

    x1  x2  x3
3    8   2   0
4    6   9   6
6    7   4   5
7    7   1   5
8    6   4   5
9    7   2   2
11   9   6   3
13   5   8   2
14   4   4   7

In [ ]:
# TODO - отобразите только колонки x1 и x2 с учетом условий 
#           (используйте .loc[])

new_df.loc[:,['x1','x2']]

    x1  x2
3    8   2
4    6   9
6    7   4
7    7   1
8    6   4
9    7   2
11   9   6
13   5   8
14   4   4

In [ ]:
# ЗАДАНИЕ - С помощью метода DataFrame.query() получите записи, 
# которые соответсвуют условию сравнения колонок x1>x3

df = pd.DataFrame(
    [[1, 2, 6], [5, 1, 1], [8, 4, 6], [4, 1, 1], [9, 9, 0], [-1, 2, 1], [5, 5, 5]],
    columns = ['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   1   2   6
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0
5  -1   2   1
6   5   5   5

In [ ]:
# TODO - Методом DataFrame.query() получить записи, удовлетворяющие условию
#           x1 > x3
df.query('x1 > x3')

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

In [ ]:
# TODO - Сделать аналогичное действие, но уже с помощью условной индексации
new_df = df['x1']>df['x3']
df[new_df]

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

In [ ]:
# ОПЕРАЦИИ С РЯДАМИ 

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   4   1   5
1   0   4   9
2   0   9   2

In [ ]:
# Создать новую колонку можно по аналогии с новым ключем в словаре
# Сложение нескольких Series и запись в новую колонку
df['x1+x2'] = df['x1'] + df['x2']
df.head(3)

   x1  x2  x3  x1+x2
0   4   1   5      5
1   0   4   9      4
2   0   9   2      9

In [ ]:
# Поэлементное умножение
df['x1*x3'] = df['x1'] * df['x3']
df.head(3)

   x1  x2  x3  x1+x2  x1*x3
0   4   1   5      5     20
1   0   4   9      4      0
2   0   9   2      9      0

In [ ]:
# Взятие среднего по колонке (метод Series.mean())
df['x1'].mean()

3.8

In [ ]:
# Использование функций numpy для работы с колонками
df['x2_exp'] = np.exp(df['x2'])
df.head(3)

   x1  x2  x3  x1+x2  x1*x3       x2_exp
0   4   1   5      5     20     2.718282
1   0   4   9      4      0    54.598150
2   0   9   2      9      0  8103.083928

In [ ]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(3, 3)), 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   8   2   7
1   1   9   0
2   0   6   8

In [ ]:
# Обязательно требование к функции - один аргумент
# Эта функция будет передана в apply() и pandas
#   будет вызывать ее и передавать в нее 
#   по одному элементу из ряда
# Возвращать функция должна результат операции над элементом
def my_func(x):
    print(type(x))
    print(x)
    return x*2

df['result'] = df['x1'].apply(my_func)
df

<class 'int'>
8
<class 'int'>
1
<class 'int'>
0

   x1  x2  x3  result
0   8   2   7      16
1   1   9   0       2
2   0   6   8       0

In [ ]:
# ОПЕРАЦИИ С ФРЕЙМАМИ - Переименование колонок/индексов
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   7   0   7
1   3   7   9
2   2   4   2

In [ ]:
# Методу передается в аргумент columns словарь, 
#   в котором ключи - имена колонок,
#   значения - новые имена для переименования
df.rename(
    columns={
        'x1': 'new_name_for_x1',
        'x3': 'that_not_x3' 
    },
    inplace=True
)
df.head(3)

   new_name_for_x1  x2  that_not_x3
0                7   0            7
1                3   7            9
2                2   4            2

In [ ]:
# ЗАДАНИЕ - Переименуйте индексы и колонки во фрейме
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    index=['A', 'B', 'C', 'D', 'E'], 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
A   7   5   2
B   5   2   6
C   3   5   1
D   0   2   2
E   4   7   1

In [ ]:
# TODO - переименуйте индексы [A, C] -> [indA, indC] 
#           и колонки [x1, x3] -> [new1, new3]
df.rename(
  index={
       'A': 'indA',
       'C': 'indC' 
  },
  columns={
        'x1': 'new1',
        'x3': 'new3' 
    },
    inplace=True
)
df

      new1  x2  new3
indA     7   5     2
B        5   2     6
indC     3   5     1
D        0   2     2
E        4   7     1

In [ ]:
# УДАЛЕНИЕ КОЛОНОК/СТРОК

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   4   1   1
1   6   4   3
2   3   1   9

In [ ]:
df.drop(columns=['x2'], inplace=True)
df.head(3)

   x1  x3
0   4   1
1   6   3
2   3   9

In [ ]:
# ОПРЕДЕЛЕНИЕ КОЛИЧЕСТВА NaN

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.iloc[0, :2] = np.nan
df.iloc[2, 1:] = np.nan

df

    x1   x2   x3
0  NaN  NaN  4.0
1  0.0  6.0  8.0
2  7.0  NaN  NaN
3  0.0  2.0  1.0
4  2.0  9.0  2.0

In [ ]:
df.isna()

      x1     x2     x3
0   True   True  False
1  False  False  False
2  False   True   True
3  False  False  False
4  False  False  False

In [ ]:
df.isna().sum()

x1    1
x2    2
x3    1
dtype: int64

In [ ]:
# ЗАПОЛНЕНИЕ ПУСТЫХ ЗНАЧЕНИЙ
df

    x1   x2   x3
0  NaN  NaN  4.0
1  0.0  6.0  8.0
2  7.0  NaN  NaN
3  0.0  2.0  1.0
4  2.0  9.0  2.0

In [ ]:
df['x2'].fillna(3, inplace=True)
df

    x1   x2   x3
0  NaN  3.0  4.0
1  0.0  6.0  8.0
2  7.0  3.0  NaN
3  0.0  2.0  1.0
4  2.0  9.0  2.0

In [ ]:
# ИНФОРМАЦИЯ ОБ УНИКАЛЬНЫХ ЗНАЧЕНИЯХ

df = pd.DataFrame({
    'col1': ['high', 'high', 'low', 'med', 'low', 'low', 'med', 'low', 'low', 'high'],
    'col2': [0, 1, 1, 2, 3, 1, 1, 2, 2, 2]
})
df

   col1  col2
0  high     0
1  high     1
2   low     1
3   med     2
4   low     3
5   low     1
6   med     1
7   low     2
8   low     2
9  high     2

In [ ]:
# Метод DataFrame.nunique() позволяет вывести 
#   количество уникальных значений в каждой колонке
# Результат - Series с индексами - названиями колонок
df.nunique()

col1    3
col2    4
dtype: int64

In [ ]:
# Метод Series.value_counts() показывает уникальные значения в ряду
#   и указывает их количество
df['col1'].value_counts()

low     5
high    3
med     2
Name: col1, dtype: int64

In [ ]:
# Результат - Series с индексами - уникальными значениями
df['col2'].value_counts()

2    4
1    4
3    1
0    1
Name: col2, dtype: int64

In [ ]:
# ФИЛЬТРАЦИЯ
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['col_one', 'col_two', 'col_three'])
df

        col_one  col_two  col_three
mouse         1        2          3
rabbit        4        5          6

In [ ]:
# Отфильтровать по именам колонок
# Аналогично df[['col_one', 'col_three']]
df.filter(items=['col_one', 'col_three'], axis='columns')

        col_one  col_three
mouse         1          3
rabbit        4          6

In [ ]:
# Отфильтровать по регулярному выражению
# Оставить только те колонки, которые оканчиваются на букву "o"
df.filter(regex='o$', axis='columns')

        col_two
mouse         2
rabbit        5

In [ ]:
# ЗАДАНИЕ - Отфильруйте записи по строке, содержащейся в имени индекса (аргумент like):
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6], [7, 8, 9])),
                  index=['dog in house', 'cat in house', 'pig in farm'],
                  columns=['x1', 'x2', 'x3'])
df

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6
pig in farm    7   8   9

In [ ]:
# TODO - отфильтруйте по записям, должны остаться записи, 
#           индекс которых содержит слово "house"
df.filter(regex='house$', axis='index')

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6

In [ ]:
# СОРТИРОВКА
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
}, index=['A', 'B', 'C', 'D', 'E', 'F'])
df

  col1  col2  col3 col4
A    A     2     0    a
B    A     1     1    B
C    B     9     9    c
D  NaN     8     4    D
E    D     7     2    e
F    C     4     3    F

In [ ]:
# Отсортируем записи колонки col2
# Именно поэтому в axis ставится rows, так как
#   операция производится в колонке по каждому ряду
df.sort_values(by='col2', axis='rows')

  col1  col2  col3 col4
B    A     1     1    B
A    A     2     0    a
F    C     4     3    F
E    D     7     2    e
D  NaN     8     4    D
C    B     9     9    c

In [ ]:
# ЗАДАНИЕ - Отсортируйте данные:
df = pd.DataFrame(
    np.random.randint(0, 20, size=(5, 5)), 
    columns=['col1', 'col2', 'col3', 'col4', 'col5']
)
df

   col1  col2  col3  col4  col5
0    13     4    13     2    19
1     9    10     5     8    11
2     8    17    11     8     2
3     3    13     6     1    10
4    10    16    16    15    15

In [ ]:
# TODO - отсортируйте данные индекса 3 по убыванию
df.sort_values(3, axis='columns', ascending=False)

   col2  col5  col3  col1  col4
0     4    19    13    13     2
1    10    11     5     9     8
2    17     2    11     8     8
3    13    10     6     3     1
4    16    15    16    10    15

In [ ]:
# РАЗДЕЛЕНИЕ ДАННЫХ НА КАТЕГОРИИ
df = pd.DataFrame({
    'temp': [59, 22, -10, 38, 20, 40, 38, 47, 20, 15, 13, 44, 57, 32, 38]
})
df.head()

   temp
0    59
1    22
2   -10
3    38
4    20

In [ ]:
# Можно задать свои границы диапазона и названия категорий
# Если планируется три категории, то границ должно быть на одну больше - 
#   так задаются диапазоны для категорий
df['temp_cat'] = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    labels=['low', 'medium', 'high'],
    # Флаг, чтобы самое левое значение границы входило в первый диапазон
    include_lowest=True
)
df.head()

   temp temp_cat
0    59     high
1    22   medium
2   -10      low
3    38     high
4    20   medium

In [ ]:
# Результат разделения имеет категориальный тип
df['temp_cat'].dtype

CategoricalDtype(categories=['low', 'medium', 'high'], ordered=True)

In [ ]:
# Можно не задавать имена категориям, тогда он сам их назовет
result_after_cut = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    include_lowest=True
)
# Взглянем на имена
result_after_cut.unique()

[(25.0, 60.0], (10.0, 25.0], (-10.001, 10.0]]
Categories (3, interval[float64]): [(-10.001, 10.0] < (10.0, 25.0] < (25.0, 60.0]]

In [ ]:
# Можно не задавать границы, лишь количество категорий - 
#   разделение будет на категории с одинаковой шириной диапазонов
result_after_cut = pd.cut(
    x=df['temp'],
    bins=3
)
result_after_cut.unique()

[(36.0, 59.0], (13.0, 36.0], (-10.069, 13.0]]
Categories (3, interval[float64]): [(-10.069, 13.0] < (13.0, 36.0] < (36.0, 59.0]]

In [ ]:
# ЗАДАНИЕ - Разделите показатель качества в диапазоне $[0, 100]$ на три группы: 
# плохое [0-20], среднее (20-45], хорошее (45-85], отличное (85-100]. 
# Выясните, что происходит со значениями, которые не попадают в диапазоны категорий:
df = pd.DataFrame({
    'quality': [ 7, 67, 21, 38,  2, -2, 79, 22,  5, 31, 77, 72, 23, 64, 99]
})
df.head()

   quality
0        7
1       67
2       21
3       38
4        2

In [ ]:
# TODO - разделите данные на категории
# TODO - определите, какие записи не имеют категорий и почему
df['groups']= pd.cut(
    x=df['quality'],
    bins=[0, 20, 45, 85, 100],
    labels=['плохое', 'среднее', 'хорошее','отличное'],
    # Флаг, чтобы самое левое значение границы входило в первый диапазон
    include_lowest=True
)
df

    quality    groups
0         7    плохое
1        67   хорошее
2        21   среднее
3        38   среднее
4         2    плохое
5        -2       NaN
6        79   хорошее
7        22   среднее
8         5    плохое
9        31   среднее
10       77   хорошее
11       72   хорошее
12       23   среднее
13       64   хорошее
14       99  отличное

In [ ]:
# АГРЕГАЦИЯ ДАННЫХ
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [ ]:
# Получим значения минимумов и средних по всем колонкам
# Принцип аналогичен операциям в numpy - 
#   для агрегации по колонка операция должна пройти по рядам,
#   соответсвенно, axis='rows'
df.aggregate(['min', 'mean'], axis='rows')

        A    B    C
min   1.0  2.0  3.0
mean  4.0  5.0  6.0

In [ ]:
# Зададим правила агрегации для каждой колонки
# Операции можно задавать строками или функциями numpy
df.aggregate({
    'A': ['sum', 'min'],
    'B': ['max', 'min'],
    'C': [np.sum, np.mean],
})

         A    B     C
max    NaN  8.0   NaN
mean   NaN  NaN   6.0
min    1.0  2.0   NaN
sum   12.0  NaN  18.0

In [ ]:
# ЗАДАНИЕ - Произведите агрегацию средним по рядам
df = pd.DataFrame(
    ([1, 2, 3], [4, 5, 6], [7, 8, 9]), 
    columns=['x1', 'x2', 'x3'])
df

   x1  x2  x3
0   1   2   3
1   4   5   6
2   7   8   9

In [ ]:
# TODO - произведите агрегацию по рядам (найти среднее)
df.aggregate(['mean'], axis='columns')

   mean
0   2.0
1   5.0
2   8.0

In [ ]:
# ГРУППИРОВКИ
data = [
    [1, 4.7, 60],
    [3, 4.5, 45],
    [4, 4.8, 40],
    [1, 4.9, 58],
    [2, 4.1, 50],
    [2, 4.2, 49],
    [2, 4.4, 49],
    [3, 4.9, 46],
    [4, 4.3, 33],
]

stud_df = pd.DataFrame(data, columns=['Grade', 'Test_Mark', 'Time'])
stud_df

   Grade  Test_Mark  Time
0      1        4.7    60
1      3        4.5    45
2      4        4.8    40
3      1        4.9    58
4      2        4.1    50
5      2        4.2    49
6      2        4.4    49
7      3        4.9    46
8      4        4.3    33

In [ ]:
gr_stud_df = stud_df.groupby(by='Grade')

# Тип результата - pd.DataFrameGroupBy
print(type(gr_stud_df))

# Таким образом увидим словарь:
#   Ключи - названия групп
#   Значения - индексы из данных для группы
gr_stud_df.groups

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

{1: Int64Index([0, 3], dtype='int64'),
 2: Int64Index([4, 5, 6], dtype='int64'),
 3: Int64Index([1, 7], dtype='int64'),
 4: Int64Index([2, 8], dtype='int64')}

In [ ]:
gr_stud_df.agg('mean')

       Test_Mark       Time
Grade
1       4.800000  59.000000
2       4.233333  49.333333
3       4.700000  45.500000
4       4.550000  36.500000

In [ ]:
# Более сложный вариант - найдем средние и минимальные время и оценку 

gr_stud_df.agg(['mean', 'min'])

      Test_Mark            Time
           mean  min       mean min
Grade
1      4.800000  4.7  59.000000  58
2      4.233333  4.1  49.333333  49
3      4.700000  4.5  45.500000  45
4      4.550000  4.3  36.500000  33

In [ ]:
# Или зададим правила для каждого признака по отдельности

res = gr_stud_df.agg({
    'Test_Mark': ['mean', 'min'],
    'Time': ['min']
})

print(type(res))
res

<class 'pandas.core.frame.DataFrame'>

      Test_Mark      Time
           mean  min  min
Grade
1      4.800000  4.7   58
2      4.233333  4.1   49
3      4.700000  4.5   45
4      4.550000  4.3   33

In [ ]:
# Для обращения к данным просто используем несколько индексов, 
#   так как это DataFrame
res['Test_Mark']['mean']

Grade
1    4.800000
2    4.233333
3    4.700000
4    4.550000
Name: mean, dtype: float64

In [ ]:
# ЗАДАНИЕ: Сгруппируйте данные по признаку x2 и найдите медиану и максимальное значения по признакам x1, x3:
df = pd.DataFrame({
    'x1': np.random.randint(10, 100, size=(200, )),
    'x2': np.random.choice(['low', 'high', 'medium'], size=(200, )),
    'x3': np.random.randint(-20, 30, size=(200, )),
})
df.head()

   x1      x2  x3
0  35     low  29
1  53  medium -11
2  48  medium   9
3  13    high  -6
4  51     low -15

In [ ]:
# TODO - произведите групировку данных
#           и получите средние и максимальные значения по каждой группе
df_new = df.groupby(by='x2')

# Тип результата - pd.DataFrameGroupBy
print(type(df_new))

# Таким образом увидим словарь:
#   Ключи - названия групп
#   Значения - индексы из данных для группы
df_new.groups

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

{'high': Int64Index([  3,   5,   8,   9,  17,  20,  26,  27,  39,  42,  45,  47,  48,
              50,  64,  73,  75,  77,  78,  86,  88,  89,  95,  98, 100, 101,
             106, 109, 111, 114, 118, 120, 122, 129, 133, 136, 137, 140, 143,
             145, 149, 156, 157, 161, 165, 171, 172, 174, 177, 178, 183, 184,
             185, 186, 189, 193, 196, 197],
            dtype='int64'),
 'low': Int64Index([  0,   4,   7,  11,  14,  24,  30,  31,  32,  33,  34,  36,  37,
              38,  41,  43,  44,  46,  49,  51,  53,  54,  56,  57,  58,  60,
              61,  62,  65,  67,  70,  71,  74,  79,  80,  82,  84,  85,  90,
              92,  94,  99, 102, 103, 108, 112, 113, 116, 117, 123, 125, 127,
             128, 131, 141, 142, 144, 150, 153, 159, 160, 162, 166, 167, 168,
             170, 175, 176, 182, 187, 190, 191, 192, 194, 195, 198, 199],
            dtype='int64'),
 'medium': Int64Index([  1,   2,   6,  10,  12,  13,  15,  16,  18,  19,  21,  22,  23,
              25,  28,  29,  35,  40,  52,  55,  59,  63,  66,  68,  69,  72,
              76,  81,  83,  87,  91,  93,  96,  97, 104, 105, 107, 110, 115,
             119, 121, 124, 126, 130, 132, 134, 135, 138, 139, 146, 147, 148,
             151, 152, 154, 155, 158, 163, 164, 169, 173, 179, 180, 181, 188],
            dtype='int64')}

In [ ]:
res = df.agg({
    'x1': ['mean', 'max'],
    'x3': ['mean', 'max']
})
res

          x1     x3
mean  55.765   3.98
max   99.000  29.00

In [5]:
# СОХРАНЕНИЕ/ЗАГРУЗКА ДАННЫХ (работы с CSV)
import string

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
df.head(3)

   x1  x2  x3
A   0   4   4
B   3   2   4
C   5   0   6

In [6]:
# Для сохранения задается путь до файла
df.to_csv('my_first_file.csv')

In [7]:
df = pd.read_csv('my_first_file.csv')
df.head(3)

  Unnamed: 0  x1  x2  x3
0          A   0   4   4
1          B   3   2   4
2          C   5   0   6

In [ ]:
df = pd.read_csv('my_first_file.csv', index_col=0)
df.head(3)

   x1  x2  x3
A   9   2   8
B   6   2   7
C   5   8   2

In [ ]:
# ЗАДАНИЕ - Разберитесь в аргументах DataFrame.to_csv() и сохраните данные в файл так, чтобы в файл индекс не сохранялся.
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)

# TODO - сохранить в файл no_index.csv без индексов

df.to_csv('no_index.csv',index=False)
df.head(3)

   x1  x2  x3
A   6   5   9
B   7   0   8
C   5   0   9

In [9]:
# ЗАДАЧКИ

# Создайте фрейм с тремя колонками:

#  Колонка с именами (тип - объекты);
#  Колонка с стажем работы (тип - вещественный);
#  Колонка с возрастом (тип - целочисленный);
#  Колонка с названием любимого цвета (тип - категориальный);
# Имена колонок и значения любые, не менее трех записей (строк) в фрейме.

# TODO - создайте фрейм и настройте правильные типы колонок
#           DataFrame.info() дожен отображать указанные типы

df = pd.DataFrame({
    'имена':['Даша','Саша','Алекс'],
    'стаж работы': np.linspace(0, 10, 3, dtype=float),
    'возраст': np.linspace(18, 65, 3, dtype=int),
    'любимый цвет': ['черный','красный','синий'],
})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   имена         3 non-null      object
 1   стаж работы   3 non-null      float64
 2   возраст       3 non-null      int64
 3   любимый цвет  3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

In [67]:
# Выберите числа в ряду ds1, которых нет в ряду ds2:
# Почитайте и примение метод Series.isin()
ds1 = pd.Series([1, 2, 3, 4, 5])
ds2 = pd.Series([4, 5, 6, 7, 8, 1, 9])

# TODO - выберите значения в ds1, которых нет в ds2: 
# [2, 3]

res = ds1.isin(ds2)
result = ds1[~res]
result[1:2]

2    3
dtype: int64

In [26]:
ds = pd.Series([2, 2, 2, 4, 4, 4, 3, 1, 1, 1, 1, 4])

# TODO - определите два наиболее частых значения в ряду (1, 4),
#           остальные замените значением 'Другое'
# ['Другое', 'Другое', 'Другое', 4, 4, 4, 'Другое', 1, 1, 1, 1, 4]

ds1 = ds.value_counts()
new_ds1 = max(ds1) == ds1
result = ds.replace(ds1[~new_ds1].index,'Другое')
result[1:15]

1     Другое
2     Другое
3          4
4          4
5          4
6     Другое
7          1
8          1
9          1
10         1
11         4
dtype: object

In [31]:
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - сделайте каждую первую букву заглавной с помощью Series.apply()
def upper(fun):
  return fun.title()
ds.apply(upper)

0        How
1         To
2        Use
3    Pandas?
dtype: object

In [36]:
df = pd.DataFrame(
    np.random.randint(0, 4, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
print(df)
# TODO - выберите те записи, которые имеют x1 равный 
#           максимальному значению в колонке x1
indexes = (df['x1']==df['x1'].max())
result = df[indexes]
result

    x1  x2  x3
0    2   2   2
1    2   2   3
2    3   0   2
3    3   0   2
4    3   1   1
5    3   1   2
6    3   3   2
7    2   2   1
8    2   1   3
9    0   3   0
10   3   1   2
11   0   2   1
12   1   3   3
13   3   3   2
14   1   2   3

    x1  x2  x3
2    3   0   2
3    3   0   2
4    3   1   1
5    3   1   2
6    3   3   2
10   3   1   2
13   3   3   2

In [44]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')
print(df)
# TODO - отобразите количество пропусков в данных по каждой колонке
df.isna().sum()

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

In [47]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')
df

# TODO - заполните NaN в колонке Min.Price средним значением по этой колонке
# NOTE - после заполнения убедитесь, что в этой колонке нет пропущенных

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

In [48]:
df['Min.Price'].fillna(df['Min.Price'].mean(), inplace = True)
df

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

In [54]:
df = pd.DataFrame(np.random.randint(0, 10, size=(5, 6)), columns=list('fbecda'))
print(df)
# TODO - получите фрейм с отсортированными по именам колонкам (f e d c b a)
# NOTE - сортировка должна быть автоматической

df=df.reindex(sorted(df.columns,reverse=True),axis=1)
df

   f  b  e  c  d  a
0  6  9  6  4  2  1
1  6  8  5  0  2  5
2  8  1  7  6  5  9
3  5  7  8  6  4  6
4  3  9  0  9  6  2

   f  e  d  c  b  a
0  6  6  2  4  9  1
1  6  5  2  0  8  5
2  8  7  5  6  1  9
3  5  8  4  6  7  6
4  3  0  6  9  9  2

In [55]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')
df
# TODO - отобразите запись с периодичностью во фрейме и определенные колонки

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

In [61]:
df.loc[[20,40,60,80],['Manufacturer','Model','Type']]

   Manufacturer    Model     Type
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [62]:
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - создайте ряд, содержащий длины строк:
# 0    3
# 1    2
# 2    3
# 3    7
# dtype: int64

ds.str.len()

0    3
1    2
2    3
3    7
dtype: int64